---
kind: enumMember
id: F:Autodesk.Revit.DB.Events.RevitAPIEventStatus.Succeeded
enum: Autodesk.Revit.DB.Events.RevitAPIEventStatus
source: html/a739b1f8-6b3b-a95b-b536-6e5d00d12e4e.htm
---
# Autodesk.Revit.DB.Events.RevitAPIEventStatus.Succeeded

The action that triggered this event succeeded.